Repository: shift4developer/shift4-ios
Catalog: Shift4/Library/Resources/Strings/*.lproj/Localizable.strings
Languages: cs, es, fi_fi, fr, it, lv, pl_pl, pt_pt, ru, sl

source: Add payment
cs: Přidat platbu
es: Añadir pago
fi_fi: Lisää maksu
fr: Ajouter un paiement
it: Aggiungi pagamento
lv: Pievienot maksājumu
pl_pl: Dodaj płatność
pt_pt: Adicionar pagamento
ru: Добавить платеж
sl: Dodaj plačilo

source: Select amount
cs: Výběr částky
es: Seleccionar importe
fi_fi: Valitse summa
fr: Sélectionner le montant
it: Seleziona importo
lv: Izvēlēties summu
pl_pl: Wybierz kwotę
pt_pt: Seleccionar quantidade
ru: Выбрать сумму
sl: Izberite znesek

source: E-mail
es: Correo electrónico
fi_fi: Sähköposti
lv: E-pasts

source: Card information
cs: Informace o kartě
es: Información de la tarjeta
fi_fi: Kortin tiedot
fr: Informations sur la carte
it: Informazioni sulla carta
lv: Kartes informācija
pl_pl: Informacje o karcie
pt_pt: Informação do cartão
ru: Информация о карте
sl: Informacije o kartici

source: Card number
cs: Číslo karty
es: Número de tarjeta
fi_fi: Kortin numero
fr: Numéro de carte
it: Numero della carta
lv: Kartes numurs
pl_pl: Numer karty
pt_pt: número do cartão
ru: Номер карты
sl: Številka_kartice

# expiration
source: Expiration date
cs: Datum expirace
es: Fecha de caducidad
fi_fi: Lopetuspäivä
fr: Date d'expiration
it: Data di scadenza
lv: Derīguma termiņš
pl_pl: Data wygaśnięcia
pt_pt: Data de expiração
ru: Дата истечения срока действия
sl: Datum veljavnosti

source: Enter payment data
cs: Zadání platebních údajů
es: Introducir los datos de pago
fi_fi: Syötä maksutiedot
fr: Entrez les données du paiement
it: Inserisci i dati di pagamento
lv: Ievadiet maksājuma datus
pl_pl: Wprowadź dane płatności
pt_pt: Introduzir dados de pagamento
ru: Введите данные платежа
sl: Vnesite podatke o plačilu

source: Confirm
cs: Potvrdit
es: Confirmar
fi_fi: Vahvista
fr: Confirmer
it: Conferma
lv: Pārbaudīt
pl_pl: Potwierdź
pt_pt: Confirmar
ru: Подтвердить
sl: Potrdi

source: Pay
cs: Platba
es: Pagar
fi_fi: Maksa
fr: Payer
it: Paga
lv: Maksāt
pl_pl: Zapłać
ru: Оплатить
sl: Plačati

source: User information
cs: Informace o uživateli
es: Información del usuario
fi_fi: Käyttäjän tiedot
fr: Informations sur l'utilisateur
it: Informazioni utente
lv: Vietotāja informācija
pl_pl: Informacje o użytkowniku
pt_pt: Informação do utilizador
ru: Информация о пользователе
sl: Informacije o uporabniku

source: Unlock card details
cs: Odemknout údaje o kartě
es: Desbloquear los datos de la tarjeta
fi_fi: Poista kortin tiedot
fr: Débloquer les détails de la carte
it: Sblocca i dettagli della carta
lv: Atbloķēt kartes informāciju
pl_pl: Odblokuj dane karty
pt_pt: Detalhes do cartão de desbloqueio
ru: Разблокировать данные карты
sl: Odkleni podatke o kartici

# sms_code_info
source: Enter the code we've just sent to your mobile phone
cs: Zadejte kód, který jsme právě zaslali na váš mobilní telefon
es: Introduzca el código que acabamos de enviar a su teléfono móvil
fi_fi: Kirjoita koodi, jonka olemme juuri lähettäneet matkapuhelimeesi
fr: Entrez le code que nous venons d'envoyer à votre téléphone portable
it: Inserisci il codice che abbiamo appena inviato al tuo cellulare
lv: Ievadiet kodu, ko mēs tikko nosūtījām uz jūsu mobilo tālruni
pl_pl: Wprowadź kod, który właśnie wysłaliśmy na Twój telefon komórkowy
pt_pt: Introduza o código que acabámos de enviar para o seu telemóvel
ru: Введите код, который мы только что отправили на ваш мобильный телефон
sl: Vnesite kodo, ki smo jo pravkar poslali na vaš mobilni telefon

source: Card
cs: Karta
es: Tarjeta
fr: Carte
it: Carta
lv: Karte
pl_pl: Karta
ru: Карта
sl: Kartica

# no_code_info
source: Didn't get the code?
cs: Nedostali jste kód?
es: ¿No has recibido el código?
fi_fi: Et saanut koodia?
fr: Vous n'avez pas reçu le code?
it: Non hai ricevuto il codice?
lv: Kodu nesaņēmāt?
pl_pl: Nie otrzymałeś kodu?
pt_pt: Não obteve o código?
ru: Не получили код?
sl: Ne prejmete kode?

# invalid_email
source: email: Invalid e-mail address
cs: email: Neplatná e-mailová adresa.
es: email: Dirección de correo electrónico no válida.
fi_fi: email: Väärennetty sähköpostiosoite.
fr: email: Adresse e-mail non valide.
it: email: Indirizzo e-mail non valido.
lv: email: Nepareiza e-pasta adrese.
pl_pl: email: Nieprawidłowy adres e-mail.
pt_pt: email: Endereço de e-mail não válido.
ru: email: Неправильный адрес электронной почты.
sl: email: Nepravilen e-poštni naslov.

# unknown_error
source: Unknown error. Try again or contact support.
cs: Neznámá chyba. Zkuste to znovu nebo kontaktujte podporu.
es: Error desconocido. Inténtelo de nuevo o póngase en contacto con el servicio de asistencia.
fi_fi: Tuntematon virhe. Yritä uudelleen tai ota yhteyttä asiakaspalveluun.
fr: Erreur inconnue. Essayez à nouveau ou contactez l'assistance.
it: Errore sconosciuto. Riprova o contatta il supporto.
lv: Nezināma kļūda. Mēģiniet vēlreiz vai sazinieties ar atbalsta dienestu.
pl_pl: Nieznany błąd. Spróbuj ponownie lub skontaktuj się z pomocą techniczną.
pt_pt: Erro desconhecido. Tente novamente ou contacte o suporte.
ru: Неизвестная ошибка. Попробуйте еще раз или обратитесь в службу поддержки.
sl: Neznana napaka. Poskusite znova ali se obrnite na podporo.

# invalid_number
source: The card number is not a valid credit card number.
cs: Číslo karty není platné.
es: El número de tarjeta no es un número de tarjeta válido.
fi_fi: Kortin numero ei ole kelvollinen kortin numero.
fr: Le numéro de carte n'est pas un numéro de carte valide.
it: Il numero della carta non è un numero valido.
lv: Kartes numurs nav derīgs kartes numurs.
pl_pl: Numer karty nie jest prawidłowym numerem karty.
pt_pt: O número do cartão não é um número de cartão válido.
ru: Номер карты не является действительным.
sl: Številka kartice ni veljavna.

# invalid_expiry_month
source: The card's expiration month is invalid.
cs: Měsíc platnosti karty je neplatný.
es: El mes de caducidad de la tarjeta no es válido.
fi_fi: Kortin voimassaolon päättymiskuukausi on virheellinen.
fr: Le mois d'expiration de la carte est invalide.
it: Il mese di scadenza della carta non è valido.
lv: Kartes derīguma termiņš ir nederīgs.
pl_pl: Nieprawidłowy miesiąc ważności karty.
pt_pt: O mês de expiração do cartão é inválido.
ru: Месяц окончания действия карты недействителен.
sl: Mesec veljavnosti kartice je neveljaven.

# invalid_expiry_year
source: The card's expiration year is invalid.
cs: Rok platnosti karty je neplatný.
es: El año de caducidad de la tarjeta no es válido.
fi_fi: Kortin viimeinen voimassaolovuosi on virheellinen.
fr: L'année d'expiration de la carte n'est pas valide.
it: L'anno di scadenza della carta non è valido.
lv: Kartes derīguma termiņš ir nederīgs.
pl_pl: Rok ważności karty jest nieprawidłowy.
pt_pt: O ano de expiração do cartão é inválido.
ru: Год окончания действия карты недействителен.
sl: Leto veljavnosti kartice je neveljavno.

# invalid_cvc
source: Your card's security code is invalid.
cs: Bezpečnostní kód karty je neplatný.
es: El código de seguridad de su tarjeta no es válido.
fi_fi: Korttisi turvakoodi on virheellinen.
fr: Le code de sécurité de votre card est invalide.
it: Il codice di sicurezza della tua carta non è valido.
lv: Kartes drošības kods ir nederīgs.
pl_pl: Kod bezpieczeństwa Twojej karty jest nieprawidłowy.
pt_pt: O código de segurança do seu cartão é inválido.
ru: Код безопасности вашей карты недействителен.
sl: Varnostna koda vaše kartice je neveljavna.

# incorrect_cvc
source: The card's security code failed verification.
cs: Bezpečnostní kód karty se nepodařilo ověřit.
es: El código de seguridad de la tarjeta no ha sido verificado.
fi_fi: Kortin turvakoodin vahvistus epäonnistui.
fr: Le code de sécurité de votre card a échoué à la vérification.
it: Il codice di sicurezza della carta non è stato verificato.
lv: Kartes drošības kods nav pārbaudīts.
pl_pl: Kod bezpieczeństwa karty nie przeszedł weryfikacji.
pt_pt: O código de segurança do cartão falhou na verificação.
ru: Защитный код вашей карты не прошел проверку.
sl: Varnostna koda kartice ni bila preverjena.

# incorrect_zip
source: The card's zip code failed verification.
cs: Poštovní směrovací číslo karty se nepodařilo ověřit.
es: El código postal de la tarjeta no ha sido verificado.
fi_fi: Kortin postinumero epäonnistui vahvistuksessa.
fr: La vérification du code postal de la carte a échoué.
it: Il codice postale della carta non ha superato la verifica.
lv: Kartes pasta indekss nav pārbaudīts.
pl_pl: Kod pocztowy karty nie przeszedł weryfikacji.
pt_pt: O código postal do cartão\i1 falhou na verificação.
ru: Почтовый код карты не прошел проверку.
sl: Poštna številka kartice ni bila preverjena.

# expired_card
source: The card has expired.
cs: Karta pozbyla platnosti.
es: La tarjeta ha caducado.
fi_fi: Kortti on vanhentunut.
fr: La carte a expiré.
it: La carta è scaduta.
lv: Kartes derīguma termiņš ir beidzies.
pl_pl: Karta straciła ważność.
pt_pt: O cartão expirou.
ru: Срок действия карты истек.
sl: Kartica je potekla.

# insufficient_funds
source: The charge amount exceeds the available funds or the card's credit limit.
cs: Suma poplatku přesahuje dostupné prostředky nebo úvěrový limit karty.
es: El importe del cargo supera el fondo disponible o el límite de crédito de la tarjeta.
fi_fi: Latauksen määrä ylittää käytettävissä olevat varat tai kortin luottorajan.
fr: Le montant de l'opération dépasse les fonds disponibles ou la limite de crédit du titulaire de la carte.
it: L'importo dell'addebito supera il fondo disponibile o il limite di credito della carta.
lv: Nomaksas summa pārsniedz pieejamo līdzekļu apjomu vai kartes kredītlimitu.
pl_pl: Kwota obciążenia przekracza dostępne środki lub limit kredytowy karty.
pt_pt: O montante da taxa excede o fundo disponível ou o limite de crédito do cartão.
ru: Сумма списания превышает доступный фонд или кредитный лимит карты.
sl: Znesek obremenitve presega razpoložljiva sredstva ali kreditni limit kartice.

# lost_or_stolen
source: The card is marked as lost or stolen.
cs: Karta je označena jako ztracená nebo odcizená.
es: La tarjeta está marcada como perdida o robada.
fi_fi: Kortti on merkitty kadonneeksi tai varastetuksi.
fr: La carte est marquée comme perdue ou volée.
it: La carta è contrassegnata come persa o rubata.
lv: Karte ir atzīmēta kā nozaudēta vai nozagta.
pl_pl: Karta jest oznaczona jako zagubiona lub skradziona.
pt_pt: O cartão é marcado como perdido ou roubado.
ru: Карта помечена как утерянная или украденная.
sl: Kartica je označena kot izgubljena ali ukradena.

# suspected_fraud
source: The charge is suspected to be fraudulent.
cs: Účet je podezřelý z podvodu.
es: Se sospecha que el cargo es fraudulento.
fi_fi: Latauksen epäillään olevan vilpillinen.
fr: La charge est suspectée d'être frauduleuse.
it: L'addebito è sospettato di essere fraudolento.
lv: Ir aizdomas, ka maksa ir krāpnieciska.
pl_pl: Opłata jest podejrzana o oszustwo.
pt_pt: A acusação é suspeita de ser fraudulenta.
ru: Списание подозревается как мошенническое.
sl: Za polnjenje se sumi, da je goljufivo.

# card_declined
source: The card was declined.
cs: Karta byla odmítnuta z jiného důvodu.
es: La tarjeta ha sido rechazada por otro motivo.
fi_fi: Kortti on hylätty muusta syystä.
fr: La carte a été refusée pour une autre raison.
it: La carta è stata rifiutata per altri motivi.
lv: Karte tika noraidīta cita iemesla dēļ.
pl_pl: Karta została odrzucona z innego powodu.
pt_pt: O cartão foi recusado por outra razão.
ru: Карта была отклонена по другой причине.
sl: Kartica je bila zavrnjena iz drugega razloga.

# processing_error
source: An error occurred while processing the card.
cs: Při zpracování karty došlo k chybě.
es: Se ha producido un error al procesar la tarjeta.
fi_fi: Kortin käsittelyssä tapahtui virhe.
fr: Une erreur s'est produite lors du traitement de la carte.
it: Si è verificato un errore durante l'elaborazione della carta.
lv: Kartes apstrādes laikā notika kļūda.
pl_pl: Podczas przetwarzania karty wystąpił błąd.
pt_pt: Ocorreu um erro durante o processamento do cartão.
ru: Во время обработки карты произошла ошибка.
sl: Pri obdelavi kartice je prišlo do napake.

# blacklisted
source: The card is blacklisted.
cs: Karta je na černé listině.
es: La tarjeta está en la lista negra.
fi_fi: Kortti on mustalla listalla.
fr: La carte est sur liste noire.
it: La carta è nella lista nera.
lv: Karte ir melnajā sarakstā.
pl_pl: Karta znajduje się na czarnej liście.
pt_pt: O cartão está na lista negra.
ru: Карта занесена в черный список.
sl: Kartica je na črnem seznamu.

# expired_token
source: The token has expired.
cs: Token vypršel.
es: El token ha caducado.
fi_fi: Kortin tunniste on vanhentunut.
fr: Le jeton a expiré.
it: Il token è scaduto.
lv: Tekena derīguma termiņš ir beidzies.
pl_pl: Token wygasł.
pt_pt: A ficha expirou.
ru: Токен истек.
sl: Znamek je potekel.

source: Enter card details
cs: Zadejte údaje o kartě
es: Introduzca los datos de la tarjeta
fi_fi: Anna kortin tiedot
fr: Saisir les détails de la carte
it: Inserisci i dettagli della carta
lv: Ievadiet kartes informāciju
pl_pl: Wprowadź dane karty
pt_pt: Introduza os detalhes do cartão
ru: Введите данные карты
sl: Vnesite podatke o kartici

# shift4_remembers
source: Shift4 remembers your card.
cs: Shift4 si vaši kartu pamatuje.
es: Shift4 recuerda su tarjeta.
fi_fi: Shift4 muistaa korttisi.
fr: Shift4 mémorise votre carte.
it: Shift4 ricorda la tua carta.
lv: Shift4 atceras jūsu karti.
pl_pl: Shift4 zapamiętuje Twoją kartę.
pt_pt: Shift4 lembra-se do seu cartão.
ru: Shift4 запоминает данные вашей карты.
sl: Shift4 si zapomni vašo kartico.

# authentication_required
source: The charge requires cardholder authentication.
cs: Poplatek vyžaduje ověření držitele karty.
es: El cargo requiere la autentificación del titular de la tarjeta.
fi_fi: Veloitus edellyttää kortinhaltijan todentamista.
fr: Le débit nécessite une authentification du titulaire de la carte.
it: L'addebito richiede l'autenticazione del titolare della carta.
lv: Maksājumam ir nepieciešama kartes turētāja autentifikācija.
pl_pl: Obciążenie wymaga uwierzytelnienia właściciela karty.
pt_pt: A cobrança requer autenticação do titular do cartão.
ru: Для списания средств требуется аутентификация держателя карты.
sl: Obračun zahteva avtentikacijo imetnika kartice.

source: Rate limit exceeded
cs: Překročení limitu připojení
es: Límite de conexiones superado
fi_fi: Liittymien raja ylitetty
fr: Limite de connexion dépassée
it: Limite di connessione superato
lv: Pārsniegts savienojumu limits
pl_pl: Przekroczony limit połączeń
pt_pt: O limite de ligações ultrapassou
ru: Превышен лимит подключений
sl: Presežena omejitev povezav

# enrolledCardIsRequired
source: The charge requires cardholder authentication.
cs: Poplatek vyžaduje ověření držitele karty.
es: El cargo requiere la autentificación del titular de la tarjeta.
fi_fi: Veloitus edellyttää kortinhaltijan todentamista.
fr: Le débit nécessite une authentification du titulaire de la carte.
it: L'addebito richiede l'autenticazione del titolare della carta.
lv: Maksājumam ir nepieciešama kartes turētāja autentifikācija.
pl_pl: Obciążenie wymaga uwierzytelnienia właściciela karty.
pt_pt: A cobrança requer autenticação do titular do cartão.
ru: Для списания средств требуется аутентификация держателя карты.
sl: Obračun zahteva avtentikacijo imetnika kartice.

# successfulLiabilityShiftIsRequired
source: The charge requires cardholder authentication.
cs: Poplatek vyžaduje ověření držitele karty.
es: El cargo requiere la autentificación del titular de la tarjeta.
fi_fi: Veloitus edellyttää kortinhaltijan todentamista.
fr: Le débit nécessite une authentification du titulaire de la carte.
it: L'addebito richiede l'autenticazione del titolare della carta.
lv: Maksājumam ir nepieciešama kartes turētāja autentifikācija.
pl_pl: Obciążenie wymaga uwierzytelnienia właściciela karty.
pt_pt: A cobrança requer autenticação do titular do cartão.
ru: Для списания средств требуется аутентификация держателя карты.
sl: Obračun zahteva avtentikacijo imetnika kartice.

# request_timedout
source: Network request timed out. Check your network and try again.
cs: Síťový požadavek vypršel. Zkontrolujte síť a zkuste to znovu.
es: Solicitud de red agotada. Compruebe la red e inténtelo de nuevo
fi_fi: Verkkopyyntö on päättynyt. Tarkista verkko ja yritä uudelleen.
fr: La demande de réseau a expiré. Vérifiez votre réseau et réessayez
it: La richiesta di rete è scaduta. Controllare la rete e riprovare
lv: Tīkla pieprasījums beidzās. Pārbaudiet tīklu un mēģiniet vēlreiz.
pl_pl: Przekroczenie limitu czasu żądania. Sprawdź swoją sieć i spróbuj ponownie.
pt_pt: O pedido de rede expirou. Verifique a sua rede e tente novamente.
ru: Запрос сети отложен. Проверьте свою сеть и попробуйте еще раз.
sl: Omrežna zahteva se je iztekla. Preverite omrežje in poskusite znova.

# poor_connection
source: Poor connection. Check your network and try again.
cs: Špatné připojení. Zkontrolujte síť a zkuste to znovu.
es: Conexión deficiente. Compruebe la red e inténtelo de nuevo
fi_fi: Huono yhteys. Tarkista verkko ja yritä uudelleen.
fr: Mauvaise connexion. Vérifiez votre réseau et réessayez.
it: Connessione scadente. Controllare la rete e riprovare
lv: Slikts savienojums. Pārbaudiet tīklu un mēģiniet vēlreiz.
pl_pl: Słabe połączenie. Sprawdź swoją sieć i spróbuj ponownie.
pt_pt: Ligação deficiente. Verifique a sua rede e tente novamente.
ru: Плохое соединение. Проверьте сеть и попробуйте еще раз.
sl: Slaba povezava. Preverite svoje omrežje in poskusite znova.

# unknown_connection_error
source: Connection error. Check your network and try again.
cs: Chyba připojení. Zkontrolujte síť a zkuste to znovu.
es: Error de conexión. Compruebe la red e inténtelo de nuevo
fi_fi: Yhteysvirhe. Tarkista verkko ja yritä uudelleen.
fr: Erreur de connexion. Vérifiez votre réseau et réessayez.
it: Errore di connessione. Controllare la rete e riprovare
lv: Savienojuma kļūda. Pārbaudiet tīklu un mēģiniet vēlreiz.
pl_pl: Błąd połączenia. Sprawdź swoją sieć i spróbuj ponownie.
pt_pt: Erro de ligação. Verifique a sua rede e tente novamente.
ru: Ошибка подключения. Проверьте сеть и попробуйте еще раз.
sl: Napaka povezave. Preverite svoje omrežje in poskusite znova.

# loading_payment_info
source: Loading payment information...
cs: Načítání informací o platbě...
es: Cargando información de pago...
fi_fi: Maksutietojen lataaminen...
fr: Chargement des informations de paiement...
it: Caricamento delle informazioni di pagamento...
lv: Maksājuma informācijas ielāde...
pl_pl: Ładowanie informacji o płatności...
pt_pt: Carregamento de informação de pagamento...
ru: Загрузка платежной информации...
sl: Nalaganje podatkov o plačilu...

# save_for_future_payments
source: Remember me in Shift4
cs: Zapamatuj si mě v Shift4
es: Recuérdame en Shift4
fi_fi: Muista minut Shift4:ssä
it: Ricordati di me in Shift4
lv: Atcerēties mani Shift4
pl_pl: Zapamiętaj mnie w Shift4
pt_pt: Lembrar-se de mim no Shift4
ru: Сохранить эту карту для будущих платежей
sl: Zapomni si me v Shift4

source: Name
cs: Křestní jméno
es: Nombre
fi_fi: Etunimi
fr: Prénom
it: Nome
lv: Vārds
pl_pl: Imię
pt_pt: Nome
sl: Ime

source: Street
es: Calle
fi_fi: Katu
fr: Rue
it: Via
pl_pl: Ulica
pt_pt: Rua
sl: Ulica

source: Zip
cs: PSČ
es: Código postal
fi_fi: Postinumero
fr: Code postal
it: Codice postale
lv: Pasta indekss
pl_pl: Kod pocztowy
sl: Poštna številka

source: City
cs: Město
es: Ciudad
fi_fi: Kaupunki
it: Città
lv: Pilsēta
pl_pl: Miasto
pt_pt: Cidade
sl: Mesto

source: Country
cs: Země
es: País
fi_fi: Maa
it: Paese
lv: Valsts
pl_pl: Kraj
pt_pt: País
sl: Država

# vat
source: VAT number
cs: DIČ
es: Número de IVA
fi_fi: Alv-numero
fr: Numéro de TVA
it: Numero di partita IVA
lv: PVN numurs
pl_pl: Numer VAT
pt_pt: Número de IVA
sl: Številka DDV

# same_address_switch
source: Same shipping and billing address
cs: Stejná dodací a fakturační adresa
es: Misma dirección de envío y de facturación
fi_fi: Sama toimitus- ja laskutusosoite
fr: Même adresse de livraison et de facturation
it: Stesso indirizzo di spedizione e di fatturazione
lv: Tā pati piegādes un norēķinu adrese
pl_pl: Ten sam adres wysyłkowy i rozliczeniowy
pt_pt: O mesmo endereço de envio e facturação
sl: Isti naslov za pošiljanje in zaračunavanje

# billing
source: Billing address
cs: Fakturační adresa
es: Dirección de facturación
fi_fi: Laskutusosoite
fr: Adresse de facturation
it: Indirizzo di fatturazione
lv: Norēķinu adrese
pl_pl: Adres rozliczeniowy
pt_pt: Morada de facturação
sl: Obračunski naslov

# shipping
source: Shipping address
cs: Adresa pro doručení
es: Dirección de envío
fi_fi: Toimitusosoite
fr: Adresse de livraison
it: Indirizzo di spedizione
lv: Piegādes adrese
pl_pl: Adres wysyłki
pt_pt: Endereço de expedição
sl: Naslov za pošiljanje

# shift4_safely_stores
source: Shift4 safely stores your credit card data.
cs: Shift4 bezpečně ukládá údaje o vaší kreditní kartě.
es: Shift4 almacena de forma segura los datos de su tarjeta de crédito.
fi_fi: Shift4 tallentaa luottokorttitietosi turvallisesti.
fr: Shift4 stocke en toute sécurité les données de votre carte de crédit.
it: Shift4 memorizza in modo sicuro i dati della carta di credito.
lv: Shift4 droši glabā jūsu kredītkartes datus.
pl_pl: Shift4 bezpiecznie przechowuje dane Twojej karty kredytowej.
pt_pt: Shift4 armazena com segurança os dados do seu cartão de crédito.
sl: Shift4 varno hrani podatke o vaši kreditni kartici.
